YCSB Outputs/Workload A/runa3
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:mongodb-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /home/swan/YCSB/mongodb/conf:/home/swan/YCSB/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/swan/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/swan/.m2/repository/org/xerial/snappy/snappy-java/1.1.7.1/snappy-java-1.1.7.1.jar:/home/swan/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/swan/.m2/repository/org/mongodb/mongo-java-driver/3.11.0/mongo-java-driver-3.11.0.jar:/home/swan/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/swan/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/home/swan/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/swan/.m2/repository/com/allanbank/mongodb-async-driver/2.0.1/mongodb-async-driver-2.0.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -t -P workloads/workloada -p operationcount=300000 -threads 16 -p mongodb.url=mongodb://localhost:27017/yscb -p mongodb.auth=true -t
Command line: -db site.ycsb.db.MongoDbClient -s -t -P workloads/workloada -p operationcount=300000 -threads 16 -p mongodb.url=mongodb://localhost:27017/yscb -p mongodb.auth=true -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2020-04-24 06:08:18:600 0 sec: 0 operations; est completion in 0 second 
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster created with settings {hosts=[localhost:27017], mode=SINGLE, requiredClusterType=UNKNOWN, serverSelectionTimeout='30000 ms', maxWaitQueueSize=500}
mongo client connection created with mongodb://localhost:27017/yscb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Cluster description not yet available. Waiting for 30000 ms before timing out
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:1, serverValue:54}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Monitor thread successfully connected to server with description ServerDescription{address=localhost:27017, type=STANDALONE, state=CONNECTED, ok=true, version=ServerVersion{versionList=[4, 2, 6]}, minWireVersion=0, maxWireVersion=8, maxDocumentSize=16777216, logicalSessionTimeoutMinutes=30, roundTripTimeNanos=4867555}
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:6, serverValue:58}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:8, serverValue:56}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:7, serverValue:60}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:15, serverValue:66}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:16, serverValue:68}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:11, serverValue:62}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:12, serverValue:63}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:17, serverValue:69}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:9, serverValue:67}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:13, serverValue:65}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:5, serverValue:55}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:10, serverValue:59}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:3, serverValue:70}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:4, serverValue:61}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:2, serverValue:57}] to localhost:27017
Apr 24, 2020 6:08:19 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Opened connection [connectionId{localValue:14, serverValue:64}] to localhost:27017
2020-04-24 06:08:28:498 10 sec: 77821 operations; 7782.1 current ops/sec; est completion in 29 seconds [READ: Count=38910, Max=648191, Min=194, Avg=1849.18, 90=3129, 99=8319, 99.9=21855, 99.99=644607] [UPDATE: Count=39098, Max=710655, Min=216, Avg=1918.98, 90=3035, 99=8391, 99.9=22399, 99.99=707071] 
2020-04-24 06:08:38:497 20 sec: 235688 operations; 15786.7 current ops/sec; est completion in 6 second [READ: Count=78282, Max=68799, Min=130, Avg=961.56, 90=1669, 99=4255, 99.9=12647, 99.99=29823] [UPDATE: Count=79732, Max=66303, Min=151, Avg=1056.1, 90=1837, 99=4671, 99.9=15295, 99.99=37407] 
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:15, serverValue:66}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:8, serverValue:56}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:7, serverValue:60}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:10, serverValue:59}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:5, serverValue:55}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:2, serverValue:57}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:16, serverValue:68}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:17, serverValue:69}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:4, serverValue:61}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:13, serverValue:65}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:6, serverValue:58}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:11, serverValue:62}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:9, serverValue:67}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:3, serverValue:70}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:14, serverValue:64}] to localhost:27017 because the pool has been closed.
Apr 24, 2020 6:08:42 AM com.mongodb.diagnostics.logging.JULLogger log
INFO: Closed connection [connectionId{localValue:12, serverValue:63}] to localhost:27017 because the pool has been closed.
2020-04-24 06:08:42:170 23 sec: 300000 operations; 17509.39 current ops/sec; [READ: Count=31877, Max=66175, Min=125, Avg=810.86, 90=1421, 99=3425, 99.9=11015, 99.99=23423] [CLEANUP: Count=16, Max=18559, Min=1, Avg=1163.12, 90=8, 99=18559, 99.9=18559, 99.99=18559] [UPDATE: Count=32101, Max=67327, Min=153, Avg=905.51, 90=1620, 99=3777, 99.9=12047, 99.99=38303] 
[OVERALL], RunTime(ms), 23673
[OVERALL], Throughput(ops/sec), 12672.665061462425
[TOTAL_GCS_G1_Young_Generation], Count, 189
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 291
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.2292485109618552
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 189
[TOTAL_GC_TIME], Time(ms), 291
[TOTAL_GC_TIME_%], Time(%), 1.2292485109618552
[READ], Operations, 149069
[READ], AverageLatency(us), 1161.0232778109466
[READ], MinLatency(us), 125
[READ], MaxLatency(us), 648191
[READ], 95thPercentileLatency(us), 2795
[READ], 99thPercentileLatency(us), 5815
[READ], Return=OK, 149069
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 1163.125
[CLEANUP], MinLatency(us), 1
[CLEANUP], MaxLatency(us), 18559
[CLEANUP], 95thPercentileLatency(us), 27
[CLEANUP], 99thPercentileLatency(us), 18559
[UPDATE], Operations, 150931
[UPDATE], AverageLatency(us), 1247.5953382671553
[UPDATE], MinLatency(us), 151
[UPDATE], MaxLatency(us), 710655
[UPDATE], 95thPercentileLatency(us), 2865
[UPDATE], 99thPercentileLatency(us), 5887
[UPDATE], Return=OK, 150931